#include<stdio.h>//โปรแกรมวาดรูปนาฬืกาทราย
int main()
{
    int n,i,a;
    printf("Enter nuber : ");
    scanf("%d",&n);
    printf("\n\n");
    for(i=1;i<=2*n-1;i++)//ฐานบน
    {
        printf("*");
    }
    printf("\n");
    //ส่วนบนและของนาฬิกา ต้องเว้นก่อนแล้วปริ้น* จากนั้น เว้น แล้วก็ ปริ้น* โดยจะมี n-2 บรรทัด
    for(i=1;i<=n-2;i++)
    {
        for(a=1;a<=i;a++)//loop เอาไว้เว้นบรรทัดส่วนเว้าของช่วงแรก
        {
            printf(" ");

        }
        printf("*");//ตีกรอบ
        for (a=1;a<=2*(n-i)-3;a++)
        {
            printf(" ");//เว้นส่วนตรงกลาง
        }
        printf("*\n");//ปิดแล้วขึ้นบรรทัดใหม่
    }
    for(a=1;a<=n-1;a++)//ส่วนตรงกลง
    {
        printf(" ");
    }
    printf("*\n");
    for(i=n-2;i>=1;i--)//เหมือนส่วนคน แค้่เปลี่ยนตัวเริ่มของ i 
    {
        for(a=1;a<=i;a++)//loop เอาไว้เว้นบรรทัดส่วนเว้าของช่วงแรก
        {
            printf(" ");

        }
        printf("*");//ตีกรอบ
        for (a=1;a<=2*(n-i)-3;a++)
        {
            printf(" ");//เว้นส่วนตรงกลาง
        }
        printf("*\n");//ปิดแล้วขึ้นบรรทัดใหม่
    }
    for(i=1;i<=2*n-1;i++)//ฐานล่าง
    {
        printf("*");
    }
}